Revit 2026 API

# ControlledApplicationCurrentUsersAddinsDataFolderPath Property

---

Path to AddinsData folder for the current user.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CurrentUsersAddinsDataFolderPath { get; }
```
```vb
Public ReadOnly Property CurrentUsersAddinsDataFolderPath As String
	Get
```
```cpp
public:
property String^ CurrentUsersAddinsDataFolderPath {
	String^ get ();
}
```
```fsharp
member CurrentUsersAddinsDataFolderPath : string with get
```

#### Property Value

String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace